Namespace(augmentation=False, generate_plots=True, real_sounds=True, spec_augment=True, trainable_layers=0)
Getting RealSounds set...
Getting RealSounds set...
Loaded FreeSounds train set and RealSounds test set!
Number of files in training set: 204
Number of files in testing set: 56
Directory used for training: Dataset/FreeSoundsSpectrograms
Directory used for testing: Dataset/RealSoundsSpectrograms
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 96, 64, 1)         0         
_________________________________________________________________
conv1 (Conv2D)               (None, 96, 64, 64)        640       
_________________________________________________________________
pool1 (MaxPooling2D)         (None, 48, 32, 64)        0         
_________________________________________________________________
conv2 (Conv2D)               (None, 48, 32, 128)       73856     
_________________________________________________________________
pool2 (MaxPooling2D)         (None, 24, 16, 128)       0         
_________________________________________________________________
conv3/conv3_1 (Conv2D)       (None, 24, 16, 256)       295168    
_________________________________________________________________
conv3/conv3_2 (Conv2D)       (None, 24, 16, 256)       590080    
_________________________________________________________________
pool3 (MaxPooling2D)         (None, 12, 8, 256)        0         
_________________________________________________________________
conv4/conv4_1 (Conv2D)       (None, 12, 8, 512)        1180160   
_________________________________________________________________
conv4/conv4_2 (Conv2D)       (None, 12, 8, 512)        2359808   
_________________________________________________________________
pool4 (MaxPooling2D)         (None, 6, 4, 512)         0         
_________________________________________________________________
flatten_ (Flatten)           (None, 12288)             0         
_________________________________________________________________
vggish_fc1/fc1_1 (Dense)     (None, 4096)              50335744  
_________________________________________________________________
vggish_fc1/fc1_2 (Dense)     (None, 4096)              16781312  
_________________________________________________________________
vggish_fc2 (Dense)           (None, 128)               524416    
_________________________________________________________________
dense_1 (Dense)              (None, 15)                1935      
=================================================================
Total params: 72,143,119
Trainable params: 67,643,407
Non-trainable params: 4,499,712
_________________________________________________________________
None
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 96, 64, 1)         0         
_________________________________________________________________
conv1 (Conv2D)               (None, 96, 64, 64)        640       
_________________________________________________________________
pool1 (MaxPooling2D)         (None, 48, 32, 64)        0         
_________________________________________________________________
conv2 (Conv2D)               (None, 48, 32, 128)       73856     
_________________________________________________________________
pool2 (MaxPooling2D)         (None, 24, 16, 128)       0         
_________________________________________________________________
conv3/conv3_1 (Conv2D)       (None, 24, 16, 256)       295168    
_________________________________________________________________
conv3/conv3_2 (Conv2D)       (None, 24, 16, 256)       590080    
_________________________________________________________________
pool3 (MaxPooling2D)         (None, 12, 8, 256)        0         
_________________________________________________________________
conv4/conv4_1 (Conv2D)       (None, 12, 8, 512)        1180160   
_________________________________________________________________
conv4/conv4_2 (Conv2D)       (None, 12, 8, 512)        2359808   
_________________________________________________________________
pool4 (MaxPooling2D)         (None, 6, 4, 512)         0         
_________________________________________________________________
flatten_ (Flatten)           (None, 12288)             0         
_________________________________________________________________
vggish_fc1/fc1_1 (Dense)     (None, 4096)              50335744  
_________________________________________________________________
vggish_fc1/fc1_2 (Dense)     (None, 4096)              16781312  
_________________________________________________________________
vggish_fc2 (Dense)           (None, 128)               524416    
=================================================================
Total params: 72,141,184
Trainable params: 0
Non-trainable params: 72,141,184
_________________________________________________________________
(9591, 96, 64, 1) train fold shape
(953, 96, 64, 1) test fold shape
X train extracted features shape (9591, 128)
max example len 333
all features shape after padding (204, 333, 128)
X test extracted features shape (953, 128)
max example len 333
Compiling ...
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 333, 64)           49408     
_________________________________________________________________
lstm_2 (LSTM)                (None, 333, 64)           33024     
_________________________________________________________________
dropout_1 (Dropout)          (None, 333, 64)           0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 21312)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 15)                319695    
=================================================================
Total params: 402,127
Trainable params: 402,127
Non-trainable params: 0
_________________________________________________________________
None
all features shape: (204, 333, 128)
a feature shape: (333, 128)
Train on 163 samples, validate on 41 samples
Epoch 1/10
 - 63s - loss: 1.2045 - accuracy: 0.6687 - val_loss: 0.1287 - val_accuracy: 0.9756
Epoch 2/10
 - 62s - loss: 0.0112 - accuracy: 1.0000 - val_loss: 0.0090 - val_accuracy: 1.0000
Epoch 3/10
 - 62s - loss: 1.2774e-04 - accuracy: 1.0000 - val_loss: 0.0102 - val_accuracy: 1.0000
Epoch 4/10
 - 62s - loss: 1.8861e-05 - accuracy: 1.0000 - val_loss: 7.9270e-05 - val_accuracy: 1.0000
Epoch 5/10
 - 62s - loss: 9.0687e-08 - accuracy: 1.0000 - val_loss: 1.2793e-07 - val_accuracy: 1.0000
Epoch 6/10
 - 62s - loss: 3.6567e-09 - accuracy: 1.0000 - val_loss: 1.9190e-07 - val_accuracy: 1.0000
Epoch 7/10
 - 62s - loss: 5.1194e-09 - accuracy: 1.0000 - val_loss: 8.9841e-07 - val_accuracy: 1.0000
Epoch 8/10
 - 62s - loss: 5.1925e-08 - accuracy: 1.0000 - val_loss: 4.6836e-06 - val_accuracy: 1.0000
Epoch 9/10
 - 62s - loss: 5.1194e-09 - accuracy: 1.0000 - val_loss: 1.1049e-07 - val_accuracy: 1.0000
Epoch 10/10
 - 62s - loss: 8.7761e-09 - accuracy: 1.0000 - val_loss: 4.0706e-08 - val_accuracy: 1.0000
Training time elapsed in seconds 622.346604347229
accuracy: 76.79%
               precision    recall  f1-score   support

        Chair       1.00      1.00      1.00         4
  ClearThroat       1.00      1.00      1.00         4
CoffeeMachine       1.00      1.00      1.00         3
     Coughing       1.00      0.25      0.40         4
    DoorKnock       1.00      1.00      1.00         3
     DoorSlam       1.00      1.00      1.00         4
       Drawer       1.00      0.50      0.67         4
FallingObject       1.00      0.25      0.40         4
    FootSteps       1.00      1.00      1.00         4
     Keyboard       1.00      1.00      1.00         4
     Laughing       1.00      0.75      0.86         4
  MilkSteamer       0.19      1.00      0.32         3
         Sink       1.00      1.00      1.00         4
     Sneezing       0.00      0.00      0.00         4
      Stiring       1.00      1.00      1.00         3

     accuracy                           0.77        56
    macro avg       0.88      0.78      0.78        56
 weighted avg       0.89      0.77      0.77        56

