Namespace(augmentation=False, generate_plots=False, real_sounds=True, spec_augment=False, trainable_layers=0, vggish_extractor=True)
Getting RealSounds set...
Getting RealSounds set...
Loaded FreeSounds train set and RealSounds test set!
Number of files in training set: 204
Number of files in testing set: 56
Directory used for training: Dataset/FreeSoundsSpectrograms
Directory used for testing: Dataset/RealSoundsSpectrograms
Model: "VGGish"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 96, 64, 1)         0         
_________________________________________________________________
conv1 (Conv2D)               (None, 96, 64, 64)        640       
_________________________________________________________________
pool1 (MaxPooling2D)         (None, 48, 32, 64)        0         
_________________________________________________________________
conv2 (Conv2D)               (None, 48, 32, 128)       73856     
_________________________________________________________________
pool2 (MaxPooling2D)         (None, 24, 16, 128)       0         
_________________________________________________________________
conv3/conv3_1 (Conv2D)       (None, 24, 16, 256)       295168    
_________________________________________________________________
conv3/conv3_2 (Conv2D)       (None, 24, 16, 256)       590080    
_________________________________________________________________
pool3 (MaxPooling2D)         (None, 12, 8, 256)        0         
_________________________________________________________________
conv4/conv4_1 (Conv2D)       (None, 12, 8, 512)        1180160   
_________________________________________________________________
conv4/conv4_2 (Conv2D)       (None, 12, 8, 512)        2359808   
_________________________________________________________________
pool4 (MaxPooling2D)         (None, 6, 4, 512)         0         
_________________________________________________________________
flatten_ (Flatten)           (None, 12288)             0         
_________________________________________________________________
vggish_fc1/fc1_1 (Dense)     (None, 4096)              50335744  
_________________________________________________________________
vggish_fc1/fc1_2 (Dense)     (None, 4096)              16781312  
_________________________________________________________________
vggish_fc2 (Dense)           (None, 128)               524416    
=================================================================
Total params: 72,141,184
Trainable params: 72,141,184
Non-trainable params: 0
_________________________________________________________________
None
Model: "VGGish"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 96, 64, 1)         0         
_________________________________________________________________
conv1 (Conv2D)               (None, 96, 64, 64)        640       
_________________________________________________________________
pool1 (MaxPooling2D)         (None, 48, 32, 64)        0         
_________________________________________________________________
conv2 (Conv2D)               (None, 48, 32, 128)       73856     
_________________________________________________________________
pool2 (MaxPooling2D)         (None, 24, 16, 128)       0         
_________________________________________________________________
conv3/conv3_1 (Conv2D)       (None, 24, 16, 256)       295168    
_________________________________________________________________
conv3/conv3_2 (Conv2D)       (None, 24, 16, 256)       590080    
_________________________________________________________________
pool3 (MaxPooling2D)         (None, 12, 8, 256)        0         
_________________________________________________________________
conv4/conv4_1 (Conv2D)       (None, 12, 8, 512)        1180160   
_________________________________________________________________
conv4/conv4_2 (Conv2D)       (None, 12, 8, 512)        2359808   
_________________________________________________________________
pool4 (MaxPooling2D)         (None, 6, 4, 512)         0         
_________________________________________________________________
flatten_ (Flatten)           (None, 12288)             0         
_________________________________________________________________
vggish_fc1/fc1_1 (Dense)     (None, 4096)              50335744  
_________________________________________________________________
vggish_fc1/fc1_2 (Dense)     (None, 4096)              16781312  
_________________________________________________________________
vggish_fc2 (Dense)           (None, 128)               524416    
=================================================================
Total params: 72,141,184
Trainable params: 0
Non-trainable params: 72,141,184
_________________________________________________________________
(3197, 96, 64, 1) train fold shape
(953, 96, 64, 1) test fold shape
X train extracted features shape (3197, 128)
max example len 111
all features shape after padding (204, 111, 128)
X test extracted features shape (953, 128)
max example len 111
Compiling ...
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 111, 64)           49408     
_________________________________________________________________
lstm_2 (LSTM)                (None, 111, 64)           33024     
_________________________________________________________________
dropout_1 (Dropout)          (None, 111, 64)           0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 7104)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 15)                106575    
=================================================================
Total params: 189,007
Trainable params: 189,007
Non-trainable params: 0
_________________________________________________________________
None
all features shape: (204, 111, 128)
a feature shape: (111, 128)
Train on 163 samples, validate on 41 samples
Epoch 1/10
 - 22s - loss: 2.7914 - accuracy: 0.1104 - val_loss: 2.8894 - val_accuracy: 0.0732
Epoch 2/10
 - 21s - loss: 1.8895 - accuracy: 0.3681 - val_loss: 1.8164 - val_accuracy: 0.3171
Epoch 3/10
 - 21s - loss: 1.4934 - accuracy: 0.4601 - val_loss: 2.2612 - val_accuracy: 0.2439
Epoch 4/10
 - 21s - loss: 1.1869 - accuracy: 0.5644 - val_loss: 2.1361 - val_accuracy: 0.3415
Epoch 5/10
 - 21s - loss: 1.1225 - accuracy: 0.5951 - val_loss: 1.9890 - val_accuracy: 0.3902
Epoch 6/10
 - 21s - loss: 0.8463 - accuracy: 0.6994 - val_loss: 1.5283 - val_accuracy: 0.5366
Epoch 7/10
 - 21s - loss: 0.7025 - accuracy: 0.7791 - val_loss: 1.6143 - val_accuracy: 0.5122
Epoch 8/10
 - 21s - loss: 0.5456 - accuracy: 0.7975 - val_loss: 1.6957 - val_accuracy: 0.4878
Epoch 9/10
 - 21s - loss: 0.5124 - accuracy: 0.8221 - val_loss: 1.9724 - val_accuracy: 0.4146
Epoch 10/10
 - 21s - loss: 0.4880 - accuracy: 0.8344 - val_loss: 3.0589 - val_accuracy: 0.2683
Training time elapsed in seconds 211.26689195632935
accuracy: 75.00%
               precision    recall  f1-score   support

        Chair       0.75      0.75      0.75         4
  ClearThroat       1.00      0.25      0.40         4
CoffeeMachine       1.00      1.00      1.00         3
     Coughing       0.44      1.00      0.62         4
    DoorKnock       0.75      1.00      0.86         3
     DoorSlam       1.00      0.25      0.40         4
       Drawer       0.75      0.75      0.75         4
FallingObject       0.50      1.00      0.67         4
    FootSteps       1.00      0.75      0.86         4
     Keyboard       1.00      1.00      1.00         4
     Laughing       1.00      1.00      1.00         4
  MilkSteamer       1.00      0.67      0.80         3
         Sink       0.80      1.00      0.89         4
     Sneezing       0.67      0.50      0.57         4
      Stiring       1.00      0.33      0.50         3

     accuracy                           0.75        56
    macro avg       0.84      0.75      0.74        56
 weighted avg       0.84      0.75      0.73        56

