Namespace(augmentation=False, generate_plots=True, real_sounds=True, spec_augment=False, trainable_layers=0)
Getting RealSounds set...
Getting RealSounds set...
Loaded FreeSounds train set and RealSounds test set!
Number of files in training set: 204
Number of files in testing set: 56
Directory used for training: Dataset/FreeSoundsSpectrograms
Directory used for testing: Dataset/RealSoundsSpectrograms
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 96, 64, 1)         0         
_________________________________________________________________
conv1 (Conv2D)               (None, 96, 64, 64)        640       
_________________________________________________________________
pool1 (MaxPooling2D)         (None, 48, 32, 64)        0         
_________________________________________________________________
conv2 (Conv2D)               (None, 48, 32, 128)       73856     
_________________________________________________________________
pool2 (MaxPooling2D)         (None, 24, 16, 128)       0         
_________________________________________________________________
conv3/conv3_1 (Conv2D)       (None, 24, 16, 256)       295168    
_________________________________________________________________
conv3/conv3_2 (Conv2D)       (None, 24, 16, 256)       590080    
_________________________________________________________________
pool3 (MaxPooling2D)         (None, 12, 8, 256)        0         
_________________________________________________________________
conv4/conv4_1 (Conv2D)       (None, 12, 8, 512)        1180160   
_________________________________________________________________
conv4/conv4_2 (Conv2D)       (None, 12, 8, 512)        2359808   
_________________________________________________________________
pool4 (MaxPooling2D)         (None, 6, 4, 512)         0         
_________________________________________________________________
flatten_ (Flatten)           (None, 12288)             0         
_________________________________________________________________
vggish_fc1/fc1_1 (Dense)     (None, 4096)              50335744  
_________________________________________________________________
vggish_fc1/fc1_2 (Dense)     (None, 4096)              16781312  
_________________________________________________________________
vggish_fc2 (Dense)           (None, 128)               524416    
_________________________________________________________________
dense_1 (Dense)              (None, 15)                1935      
=================================================================
Total params: 72,143,119
Trainable params: 67,643,407
Non-trainable params: 4,499,712
_________________________________________________________________
None
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 96, 64, 1)         0         
_________________________________________________________________
conv1 (Conv2D)               (None, 96, 64, 64)        640       
_________________________________________________________________
pool1 (MaxPooling2D)         (None, 48, 32, 64)        0         
_________________________________________________________________
conv2 (Conv2D)               (None, 48, 32, 128)       73856     
_________________________________________________________________
pool2 (MaxPooling2D)         (None, 24, 16, 128)       0         
_________________________________________________________________
conv3/conv3_1 (Conv2D)       (None, 24, 16, 256)       295168    
_________________________________________________________________
conv3/conv3_2 (Conv2D)       (None, 24, 16, 256)       590080    
_________________________________________________________________
pool3 (MaxPooling2D)         (None, 12, 8, 256)        0         
_________________________________________________________________
conv4/conv4_1 (Conv2D)       (None, 12, 8, 512)        1180160   
_________________________________________________________________
conv4/conv4_2 (Conv2D)       (None, 12, 8, 512)        2359808   
_________________________________________________________________
pool4 (MaxPooling2D)         (None, 6, 4, 512)         0         
_________________________________________________________________
flatten_ (Flatten)           (None, 12288)             0         
_________________________________________________________________
vggish_fc1/fc1_1 (Dense)     (None, 4096)              50335744  
_________________________________________________________________
vggish_fc1/fc1_2 (Dense)     (None, 4096)              16781312  
_________________________________________________________________
vggish_fc2 (Dense)           (None, 128)               524416    
=================================================================
Total params: 72,141,184
Trainable params: 0
Non-trainable params: 72,141,184
_________________________________________________________________
(3197, 96, 64, 1) train fold shape
(953, 96, 64, 1) test fold shape
X train extracted features shape (3197, 128)
max example len 111
all features shape after padding (204, 111, 128)
X test extracted features shape (953, 128)
max example len 111
Compiling ...
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 111, 64)           49408     
_________________________________________________________________
lstm_2 (LSTM)                (None, 111, 64)           33024     
_________________________________________________________________
dropout_1 (Dropout)          (None, 111, 64)           0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 7104)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 15)                106575    
=================================================================
Total params: 189,007
Trainable params: 189,007
Non-trainable params: 0
_________________________________________________________________
None
all features shape: (204, 111, 128)
a feature shape: (111, 128)
Train on 163 samples, validate on 41 samples
Epoch 1/10
 - 21s - loss: 1.5978 - accuracy: 0.6196 - val_loss: 0.3195 - val_accuracy: 0.9512
Epoch 2/10
 - 21s - loss: 0.0486 - accuracy: 0.9939 - val_loss: 0.0167 - val_accuracy: 1.0000
Epoch 3/10
 - 21s - loss: 0.0010 - accuracy: 1.0000 - val_loss: 0.0013 - val_accuracy: 1.0000
Epoch 4/10
 - 21s - loss: 1.0387e-04 - accuracy: 1.0000 - val_loss: 2.3149e-05 - val_accuracy: 1.0000
Epoch 5/10
 - 21s - loss: 4.5435e-05 - accuracy: 1.0000 - val_loss: 2.5237e-06 - val_accuracy: 1.0000
Epoch 6/10
 - 21s - loss: 1.0794e-06 - accuracy: 1.0000 - val_loss: 5.3789e-07 - val_accuracy: 1.0000
Epoch 7/10
 - 21s - loss: 4.6659e-07 - accuracy: 1.0000 - val_loss: 1.4538e-07 - val_accuracy: 1.0000
Epoch 8/10
 - 21s - loss: 1.1994e-07 - accuracy: 1.0000 - val_loss: 5.2336e-08 - val_accuracy: 1.0000
Epoch 9/10
 - 21s - loss: 1.0312e-07 - accuracy: 1.0000 - val_loss: 2.6168e-08 - val_accuracy: 1.0000
Epoch 10/10
 - 21s - loss: 1.1409e-07 - accuracy: 1.0000 - val_loss: 1.1630e-08 - val_accuracy: 1.0000
Training time elapsed in seconds 208.46745133399963
accuracy: 100.00%
               precision    recall  f1-score   support

        Chair       1.00      1.00      1.00         4
  ClearThroat       1.00      1.00      1.00         4
CoffeeMachine       1.00      1.00      1.00         3
     Coughing       1.00      1.00      1.00         4
    DoorKnock       1.00      1.00      1.00         3
     DoorSlam       1.00      1.00      1.00         4
       Drawer       1.00      1.00      1.00         4
FallingObject       1.00      1.00      1.00         4
    FootSteps       1.00      1.00      1.00         4
     Keyboard       1.00      1.00      1.00         4
     Laughing       1.00      1.00      1.00         4
  MilkSteamer       1.00      1.00      1.00         3
         Sink       1.00      1.00      1.00         4
     Sneezing       1.00      1.00      1.00         4
      Stiring       1.00      1.00      1.00         3

     accuracy                           1.00        56
    macro avg       1.00      1.00      1.00        56
 weighted avg       1.00      1.00      1.00        56



	

