Namespace(augmentation=True, generate_plots=True, real_sounds=True, spec_augment=False, trainable_layers=0)
Getting RealSounds set...
Getting RealSounds set...
Loaded FreeSounds train set and RealSounds test set!
Number of files in training set: 204
Number of files in testing set: 56
Directory used for training: Dataset/FreeSoundsAugmentedSpectrograms
Directory used for testing: Dataset/RealSoundsSpectrograms
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 96, 64, 1)         0         
_________________________________________________________________
conv1 (Conv2D)               (None, 96, 64, 64)        640       
_________________________________________________________________
pool1 (MaxPooling2D)         (None, 48, 32, 64)        0         
_________________________________________________________________
conv2 (Conv2D)               (None, 48, 32, 128)       73856     
_________________________________________________________________
pool2 (MaxPooling2D)         (None, 24, 16, 128)       0         
_________________________________________________________________
conv3/conv3_1 (Conv2D)       (None, 24, 16, 256)       295168    
_________________________________________________________________
conv3/conv3_2 (Conv2D)       (None, 24, 16, 256)       590080    
_________________________________________________________________
pool3 (MaxPooling2D)         (None, 12, 8, 256)        0         
_________________________________________________________________
conv4/conv4_1 (Conv2D)       (None, 12, 8, 512)        1180160   
_________________________________________________________________
conv4/conv4_2 (Conv2D)       (None, 12, 8, 512)        2359808   
_________________________________________________________________
pool4 (MaxPooling2D)         (None, 6, 4, 512)         0         
_________________________________________________________________
flatten_ (Flatten)           (None, 12288)             0         
_________________________________________________________________
vggish_fc1/fc1_1 (Dense)     (None, 4096)              50335744  
_________________________________________________________________
vggish_fc1/fc1_2 (Dense)     (None, 4096)              16781312  
_________________________________________________________________
vggish_fc2 (Dense)           (None, 128)               524416    
_________________________________________________________________
dense_1 (Dense)              (None, 15)                1935      
=================================================================
Total params: 72,143,119
Trainable params: 67,643,407
Non-trainable params: 4,499,712
_________________________________________________________________
None
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 96, 64, 1)         0         
_________________________________________________________________
conv1 (Conv2D)               (None, 96, 64, 64)        640       
_________________________________________________________________
pool1 (MaxPooling2D)         (None, 48, 32, 64)        0         
_________________________________________________________________
conv2 (Conv2D)               (None, 48, 32, 128)       73856     
_________________________________________________________________
pool2 (MaxPooling2D)         (None, 24, 16, 128)       0         
_________________________________________________________________
conv3/conv3_1 (Conv2D)       (None, 24, 16, 256)       295168    
_________________________________________________________________
conv3/conv3_2 (Conv2D)       (None, 24, 16, 256)       590080    
_________________________________________________________________
pool3 (MaxPooling2D)         (None, 12, 8, 256)        0         
_________________________________________________________________
conv4/conv4_1 (Conv2D)       (None, 12, 8, 512)        1180160   
_________________________________________________________________
conv4/conv4_2 (Conv2D)       (None, 12, 8, 512)        2359808   
_________________________________________________________________
pool4 (MaxPooling2D)         (None, 6, 4, 512)         0         
_________________________________________________________________
flatten_ (Flatten)           (None, 12288)             0         
_________________________________________________________________
vggish_fc1/fc1_1 (Dense)     (None, 4096)              50335744  
_________________________________________________________________
vggish_fc1/fc1_2 (Dense)     (None, 4096)              16781312  
_________________________________________________________________
vggish_fc2 (Dense)           (None, 128)               524416    
=================================================================
Total params: 72,141,184
Trainable params: 0
Non-trainable params: 72,141,184
_________________________________________________________________
(16245, 96, 64, 1) train fold shape
(953, 96, 64, 1) test fold shape
X train extracted features shape (16245, 128)
max example len 568
all features shape after padding (204, 568, 128)
X test extracted features shape (953, 128)
max example len 568
Compiling ...
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 568, 64)           49408     
_________________________________________________________________
lstm_2 (LSTM)                (None, 568, 64)           33024     
_________________________________________________________________
dropout_1 (Dropout)          (None, 568, 64)           0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 36352)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 15)                545295    
=================================================================
Total params: 627,727
Trainable params: 627,727
Non-trainable params: 0
_________________________________________________________________
None
all features shape: (204, 568, 128)
a feature shape: (568, 128)
Train on 163 samples, validate on 41 samples
Epoch 1/10
 - 107s - loss: 1.0468 - accuracy: 0.7791 - val_loss: 0.0307 - val_accuracy: 1.0000
Epoch 2/10
 - 106s - loss: 0.0038 - accuracy: 1.0000 - val_loss: 0.0108 - val_accuracy: 1.0000
Epoch 3/10
 - 106s - loss: 1.2584e-04 - accuracy: 1.0000 - val_loss: 3.4861e-06 - val_accuracy: 1.0000
Epoch 4/10
 - 106s - loss: 5.9239e-08 - accuracy: 1.0000 - val_loss: 4.1868e-07 - val_accuracy: 1.0000
Epoch 5/10
 - 106s - loss: 6.8746e-08 - accuracy: 1.0000 - val_loss: 8.4319e-08 - val_accuracy: 1.0000
Epoch 6/10
 - 106s - loss: 2.1940e-09 - accuracy: 1.0000 - val_loss: 1.5410e-07 - val_accuracy: 1.0000
Epoch 7/10
 - 106s - loss: 5.8508e-09 - accuracy: 1.0000 - val_loss: 2.5233e-05 - val_accuracy: 1.0000
Epoch 8/10
 - 106s - loss: 3.6567e-09 - accuracy: 1.0000 - val_loss: 2.9075e-08 - val_accuracy: 1.0000
Epoch 9/10
 - 106s - loss: 5.8508e-09 - accuracy: 1.0000 - val_loss: 4.3613e-08 - val_accuracy: 1.0000
Epoch 10/10
 - 106s - loss: 3.6567e-09 - accuracy: 1.0000 - val_loss: 1.4538e-08 - val_accuracy: 1.0000
Training time elapsed in seconds 1064.102026939392
accuracy: 58.93%
               precision    recall  f1-score   support

        Chair       1.00      0.75      0.86         4
  ClearThroat       1.00      0.75      0.86         4
CoffeeMachine       1.00      1.00      1.00         3
     Coughing       0.00      0.00      0.00         4
    DoorKnock       1.00      1.00      1.00         3
     DoorSlam       0.00      0.00      0.00         4
       Drawer       0.17      1.00      0.29         4
FallingObject       0.00      0.00      0.00         4
    FootSteps       1.00      1.00      1.00         4
     Keyboard       1.00      0.50      0.67         4
     Laughing       1.00      1.00      1.00         4
  MilkSteamer       1.00      1.00      1.00         3
         Sink       1.00      0.25      0.40         4
     Sneezing       0.00      0.00      0.00         4
      Stiring       0.50      1.00      0.67         3

     accuracy                           0.59        56
    macro avg       0.64      0.62      0.58        56
 weighted avg       0.63      0.59      0.56        56

