Namespace(augmentation=True, generate_plots=False, real_sounds=True, spec_augment=True, trainable_layers=0, vggish_extractor=True)
Getting RealSounds set...
Getting RealSounds set...
Loaded FreeSounds train set and RealSounds test set!
Number of files in training set: 204
Number of files in testing set: 56
Directory used for training: Dataset/FreeSoundsAugmentedSpectrograms
Directory used for testing: Dataset/RealSoundsSpectrograms
Model: "VGGish"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 96, 64, 1)         0         
_________________________________________________________________
conv1 (Conv2D)               (None, 96, 64, 64)        640       
_________________________________________________________________
pool1 (MaxPooling2D)         (None, 48, 32, 64)        0         
_________________________________________________________________
conv2 (Conv2D)               (None, 48, 32, 128)       73856     
_________________________________________________________________
pool2 (MaxPooling2D)         (None, 24, 16, 128)       0         
_________________________________________________________________
conv3/conv3_1 (Conv2D)       (None, 24, 16, 256)       295168    
_________________________________________________________________
conv3/conv3_2 (Conv2D)       (None, 24, 16, 256)       590080    
_________________________________________________________________
pool3 (MaxPooling2D)         (None, 12, 8, 256)        0         
_________________________________________________________________
conv4/conv4_1 (Conv2D)       (None, 12, 8, 512)        1180160   
_________________________________________________________________
conv4/conv4_2 (Conv2D)       (None, 12, 8, 512)        2359808   
_________________________________________________________________
pool4 (MaxPooling2D)         (None, 6, 4, 512)         0         
_________________________________________________________________
flatten_ (Flatten)           (None, 12288)             0         
_________________________________________________________________
vggish_fc1/fc1_1 (Dense)     (None, 4096)              50335744  
_________________________________________________________________
vggish_fc1/fc1_2 (Dense)     (None, 4096)              16781312  
_________________________________________________________________
vggish_fc2 (Dense)           (None, 128)               524416    
=================================================================
Total params: 72,141,184
Trainable params: 72,141,184
Non-trainable params: 0
_________________________________________________________________
None
Model: "VGGish"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 96, 64, 1)         0         
_________________________________________________________________
conv1 (Conv2D)               (None, 96, 64, 64)        640       
_________________________________________________________________
pool1 (MaxPooling2D)         (None, 48, 32, 64)        0         
_________________________________________________________________
conv2 (Conv2D)               (None, 48, 32, 128)       73856     
_________________________________________________________________
pool2 (MaxPooling2D)         (None, 24, 16, 128)       0         
_________________________________________________________________
conv3/conv3_1 (Conv2D)       (None, 24, 16, 256)       295168    
_________________________________________________________________
conv3/conv3_2 (Conv2D)       (None, 24, 16, 256)       590080    
_________________________________________________________________
pool3 (MaxPooling2D)         (None, 12, 8, 256)        0         
_________________________________________________________________
conv4/conv4_1 (Conv2D)       (None, 12, 8, 512)        1180160   
_________________________________________________________________
conv4/conv4_2 (Conv2D)       (None, 12, 8, 512)        2359808   
_________________________________________________________________
pool4 (MaxPooling2D)         (None, 6, 4, 512)         0         
_________________________________________________________________
flatten_ (Flatten)           (None, 12288)             0         
_________________________________________________________________
vggish_fc1/fc1_1 (Dense)     (None, 4096)              50335744  
_________________________________________________________________
vggish_fc1/fc1_2 (Dense)     (None, 4096)              16781312  
_________________________________________________________________
vggish_fc2 (Dense)           (None, 128)               524416    
=================================================================
Total params: 72,141,184
Trainable params: 0
Non-trainable params: 72,141,184
_________________________________________________________________
(48735, 96, 64, 1) train fold shape
(953, 96, 64, 1) test fold shape
X train extracted features shape (48735, 128)
max example len 1704
all features shape after padding (204, 1704, 128)
X test extracted features shape (953, 128)
max example len 1704
Compiling ...
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 1704, 64)          49408     
_________________________________________________________________
lstm_2 (LSTM)                (None, 1704, 64)          33024     
_________________________________________________________________
dropout_1 (Dropout)          (None, 1704, 64)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 109056)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 15)                1635855   
=================================================================
Total params: 1,718,287
Trainable params: 1,718,287
Non-trainable params: 0
_________________________________________________________________
None
all features shape: (204, 1704, 128)
a feature shape: (1704, 128)
Train on 163 samples, validate on 41 samples
Epoch 1/10
 - 351s - loss: 4.1689 - accuracy: 0.1840 - val_loss: 2.9708 - val_accuracy: 0.2195
Epoch 2/10
 - 351s - loss: 1.5262 - accuracy: 0.5215 - val_loss: 2.4553 - val_accuracy: 0.2195
Epoch 3/10
 - 351s - loss: 0.9735 - accuracy: 0.6687 - val_loss: 2.3601 - val_accuracy: 0.3415
Epoch 4/10
 - 350s - loss: 0.4984 - accuracy: 0.8160 - val_loss: 1.8694 - val_accuracy: 0.4146
Epoch 5/10
 - 350s - loss: 0.3880 - accuracy: 0.8773 - val_loss: 2.2777 - val_accuracy: 0.4146
Epoch 6/10
 - 350s - loss: 0.2243 - accuracy: 0.9264 - val_loss: 2.0700 - val_accuracy: 0.5366
Epoch 7/10
 - 351s - loss: 0.1273 - accuracy: 0.9387 - val_loss: 3.8479 - val_accuracy: 0.4634
Epoch 8/10
 - 350s - loss: 0.0874 - accuracy: 0.9755 - val_loss: 3.2409 - val_accuracy: 0.3659
Epoch 9/10
 - 350s - loss: 0.1099 - accuracy: 0.9816 - val_loss: 3.1571 - val_accuracy: 0.4146
Epoch 10/10
 - 350s - loss: 0.0896 - accuracy: 0.9816 - val_loss: 3.4160 - val_accuracy: 0.4878
Training time elapsed in seconds 3505.845160961151
accuracy: 19.64%
               precision    recall  f1-score   support

        Chair       0.00      0.00      0.00         4
  ClearThroat       0.38      0.75      0.50         4
CoffeeMachine       1.00      0.33      0.50         3
     Coughing       0.00      0.00      0.00         4
    DoorKnock       1.00      0.33      0.50         3
     DoorSlam       0.00      0.00      0.00         4
       Drawer       0.20      0.50      0.29         4
FallingObject       0.00      0.00      0.00         4
    FootSteps       0.05      0.25      0.08         4
     Keyboard       0.50      0.50      0.50         4
     Laughing       0.00      0.00      0.00         4
  MilkSteamer       0.00      0.00      0.00         3
         Sink       0.25      0.25      0.25         4
     Sneezing       0.00      0.00      0.00         4
      Stiring       0.00      0.00      0.00         3

     accuracy                           0.20        56
    macro avg       0.23      0.19      0.17        56
 weighted avg       0.21      0.20      0.17        56

