Namespace(augmentation=True, generate_plots=True, real_sounds=True, spec_augment=True, trainable_layers=0)
Getting RealSounds set...
Getting RealSounds set...
Loaded FreeSounds train set and RealSounds test set!
Number of files in training set: 204
Number of files in testing set: 56
Directory used for training: Dataset/FreeSoundsAugmentedSpectrograms
Directory used for testing: Dataset/RealSoundsSpectrograms
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 96, 64, 1)         0         
_________________________________________________________________
conv1 (Conv2D)               (None, 96, 64, 64)        640       
_________________________________________________________________
pool1 (MaxPooling2D)         (None, 48, 32, 64)        0         
_________________________________________________________________
conv2 (Conv2D)               (None, 48, 32, 128)       73856     
_________________________________________________________________
pool2 (MaxPooling2D)         (None, 24, 16, 128)       0         
_________________________________________________________________
conv3/conv3_1 (Conv2D)       (None, 24, 16, 256)       295168    
_________________________________________________________________
conv3/conv3_2 (Conv2D)       (None, 24, 16, 256)       590080    
_________________________________________________________________
pool3 (MaxPooling2D)         (None, 12, 8, 256)        0         
_________________________________________________________________
conv4/conv4_1 (Conv2D)       (None, 12, 8, 512)        1180160   
_________________________________________________________________
conv4/conv4_2 (Conv2D)       (None, 12, 8, 512)        2359808   
_________________________________________________________________
pool4 (MaxPooling2D)         (None, 6, 4, 512)         0         
_________________________________________________________________
flatten_ (Flatten)           (None, 12288)             0         
_________________________________________________________________
vggish_fc1/fc1_1 (Dense)     (None, 4096)              50335744  
_________________________________________________________________
vggish_fc1/fc1_2 (Dense)     (None, 4096)              16781312  
_________________________________________________________________
vggish_fc2 (Dense)           (None, 128)               524416    
_________________________________________________________________
dense_1 (Dense)              (None, 15)                1935      
=================================================================
Total params: 72,143,119
Trainable params: 67,643,407
Non-trainable params: 4,499,712
_________________________________________________________________
None
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 96, 64, 1)         0         
_________________________________________________________________
conv1 (Conv2D)               (None, 96, 64, 64)        640       
_________________________________________________________________
pool1 (MaxPooling2D)         (None, 48, 32, 64)        0         
_________________________________________________________________
conv2 (Conv2D)               (None, 48, 32, 128)       73856     
_________________________________________________________________
pool2 (MaxPooling2D)         (None, 24, 16, 128)       0         
_________________________________________________________________
conv3/conv3_1 (Conv2D)       (None, 24, 16, 256)       295168    
_________________________________________________________________
conv3/conv3_2 (Conv2D)       (None, 24, 16, 256)       590080    
_________________________________________________________________
pool3 (MaxPooling2D)         (None, 12, 8, 256)        0         
_________________________________________________________________
conv4/conv4_1 (Conv2D)       (None, 12, 8, 512)        1180160   
_________________________________________________________________
conv4/conv4_2 (Conv2D)       (None, 12, 8, 512)        2359808   
_________________________________________________________________
pool4 (MaxPooling2D)         (None, 6, 4, 512)         0         
_________________________________________________________________
flatten_ (Flatten)           (None, 12288)             0         
_________________________________________________________________
vggish_fc1/fc1_1 (Dense)     (None, 4096)              50335744  
_________________________________________________________________
vggish_fc1/fc1_2 (Dense)     (None, 4096)              16781312  
_________________________________________________________________
vggish_fc2 (Dense)           (None, 128)               524416    
=================================================================
Total params: 72,141,184
Trainable params: 0
Non-trainable params: 72,141,184
_________________________________________________________________
(48735, 96, 64, 1) train fold shape
(953, 96, 64, 1) test fold shape
X train extracted features shape (48735, 128)
max example len 1704
all features shape after padding (204, 1704, 128)
X test extracted features shape (953, 128)
max example len 1704
Compiling ...
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 1704, 64)          49408     
_________________________________________________________________
lstm_2 (LSTM)                (None, 1704, 64)          33024     
_________________________________________________________________
dropout_1 (Dropout)          (None, 1704, 64)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 109056)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 15)                1635855   
=================================================================
Total params: 1,718,287
Trainable params: 1,718,287
Non-trainable params: 0
_________________________________________________________________
None
all features shape: (204, 1704, 128)
a feature shape: (1704, 128)
Train on 163 samples, validate on 41 samples
Epoch 1/10
 - 348s - loss: 2.4505 - accuracy: 0.6626 - val_loss: 0.0220 - val_accuracy: 1.0000
Epoch 2/10
 - 348s - loss: 0.2390 - accuracy: 0.9632 - val_loss: 0.0081 - val_accuracy: 1.0000
Epoch 3/10
 - 347s - loss: 0.0099 - accuracy: 0.9939 - val_loss: 1.2222 - val_accuracy: 0.7073
Epoch 4/10
 - 348s - loss: 0.1238 - accuracy: 0.9816 - val_loss: 0.0629 - val_accuracy: 0.9512
Epoch 5/10
 - 347s - loss: 0.2553 - accuracy: 0.9632 - val_loss: 1.7678e-05 - val_accuracy: 1.0000
Epoch 6/10
 - 348s - loss: 2.1136e-07 - accuracy: 1.0000 - val_loss: 5.2360e-06 - val_accuracy: 1.0000
Epoch 7/10
 - 347s - loss: 1.2433e-08 - accuracy: 1.0000 - val_loss: 2.3126e-05 - val_accuracy: 1.0000
Epoch 8/10
 - 348s - loss: 2.8522e-08 - accuracy: 1.0000 - val_loss: 7.5998e-06 - val_accuracy: 1.0000
Epoch 9/10
 - 348s - loss: 0.0000e+00 - accuracy: 1.0000 - val_loss: 2.5586e-06 - val_accuracy: 1.0000
Epoch 10/10
 - 348s - loss: 0.0000e+00 - accuracy: 1.0000 - val_loss: 2.8377e-06 - val_accuracy: 1.0000
Training time elapsed in seconds 3476.5905561447144
accuracy: 35.71%
               precision    recall  f1-score   support

        Chair       1.00      0.50      0.67         4
  ClearThroat       0.00      0.00      0.00         4
CoffeeMachine       0.38      1.00      0.55         3
     Coughing       0.00      0.00      0.00         4
    DoorKnock       0.00      0.00      0.00         3
     DoorSlam       1.00      0.25      0.40         4
       Drawer       1.00      0.25      0.40         4
FallingObject       0.00      0.00      0.00         4
    FootSteps       1.00      0.75      0.86         4
     Keyboard       0.00      0.00      0.00         4
     Laughing       0.80      1.00      0.89         4
  MilkSteamer       1.00      0.33      0.50         3
         Sink       1.00      0.25      0.40         4
     Sneezing       0.12      1.00      0.21         4
      Stiring       0.00      0.00      0.00         3

     accuracy                           0.36        56
    macro avg       0.49      0.36      0.32        56
 weighted avg       0.50      0.36      0.33        56

